spec adjustments
